<script setup lang="ts">
import {defineEmits, defineProps} from "vue";
import BaseModal from "@/components/Modals/BaseModal.vue";

const props = defineProps<{
  modelValue: boolean;
}>();

const emit = defineEmits<{
  (e: "update:modelValue", value: boolean): void;
}>();

</script>

<template>
  <BaseModal
      :modelValue="props.modelValue"
      @update:modelValue="val => emit('update:modelValue', val)"
  >
    <div class="text-sm text-zinc-700 max-h-[80vh]  leading-relaxed px-1">
      <h3 class="text-xl font-semibold text-center mb-6">
        Согласие на обработку персональных данных
      </h3>

      <p class="mb-4">
        Пользователь, оставляя свои данные на интернет-сайтах phoenix-combat.ru, принимает настоящее Согласие на
        обработку персональных данных (далее – Согласие).
      </p>

      <p class="mb-4">
        Действуя свободно, по своей воле и в своем интересе, а также подтверждая свою дееспособность, Пользователь
        дает свое согласие Ставропольской городской спортивной общественной организации “Федерация спортивной борьбы
        грэпплинг” (ОГРНИП: 115265101380), на обработку своих персональных данных со следующими условиями:
      </p>

      <ol class="list-decimal list-inside space-y-4">
        <li>
          Данное Согласие дается на обработку персональных данных, как без использования средств автоматизации, так и с
          их использованием.
        </li>
        <li>
          Согласие дается на обработку следующих персональных данных:
          <ul class="list-disc list-inside mt-2 ml-4">
            <li>Фамилия</li>
            <li>Имя</li>
            <li>Отчество</li>
            <li>Контактные данные</li>
            <li>Дата рождения</li>
            <li>Адрес</li>
          </ul>
        </li>
        <li>
          Цель обработки персональных данных: обработка входящих запросов физических лиц с целью регистрации на
          соревнования, дружеские встречи.
        </li>
        <li>
          Основанием для обработки персональных данных является:
          <ul class="list-disc list-inside mt-2 ml-4">
            <li>ст. 24 Конституции Российской Федерации</li>
            <li>ст. 6 Федерального закона №152-ФЗ «О персональных данных»</li>
            <li>настоящее согласие на обработку персональных данных</li>
          </ul>
        </li>
        <li>
          В ходе обработки с персональными данными будут совершены следующие действия:
          <ul class="list-disc list-inside mt-2 ml-4">
            <li>сбор</li>
            <li>запись</li>
            <li>систематизация</li>
            <li>накопление</li>
            <li>хранение</li>
            <li>уточнение (обновление, изменение)</li>
            <li>извлечение</li>
            <li>использование</li>
            <li>передача (распространение, предоставление, доступ)</li>
            <li>блокирование</li>
            <li>удаление</li>
            <li>уничтожение</li>
          </ul>
        </li>
        <li>
          Обработка персональных данных может быть прекращена по запросу субъекта персональных данных.
        </li>
        <li>
          Настоящее согласие действует все время до момента прекращения обработки персональных данных.
        </li>
      </ol>
    </div>
  </BaseModal>
</template>
