export const districts = [
  "ЦФО", "СЗФО", "ЮФО", "СКФО", "ПФО", "УФО", "СФО", "ДФО"
];

export const citiesByDistrict: Record<string, string[]> = {
  "ЦФО": [
    "Москва", "Белгород", "Брянск", "Владимир", "Воронеж", "Иваново", "Калуга", "Кострома",
    "Курск", "Липецк", "Орёл", "Рязань", "Смоленск", "Тамбов", "Тверь", "Тула", "Ярославль"
  ],
  "СЗФО": [
    "Санкт-Петербург", "Архангельск", "Вологда", "Калининград", "Карелия", "Коми", "Мурманск",
    "Новгород", "Псков"
  ],
  "ЮФО": [
    "Адыгея", "Астрахань", "Волгоград", "Калмыкия", "Краснодар", "Ростов-на-Дону"
  ],
  "СКФО": [
    "Дагестан", "Ингушетия", "Кабардино-Балкария", "Карачаево-Черкесия", "Северная Осетия",
    "Ставрополь", "Чечня"
  ],
  "ПФО": [
    "Башкортостан", "Киров", "Марий Эл", "Мордовия", "Нижегородская", "Оренбург", "Пенза",
    "Пермь", "Самара", "Саратов", "Татарстан", "Удмуртия", "Ульяновск", "Чувашия"
  ],
  "УФО": [
    "Курган", "Свердловск", "Тюмень", "Челябинск", "ХМАО", "ЯНАО"
  ],
  "СФО": [
    "Алтай", "Алтайский край", "Бурятия", "Забайкальский край", "Иркутск", "Кемерово",
    "Красноярск", "Новосибирск", "Омск", "Томск", "Тыва", "Хакасия"
  ],
  "ДФО": [
    "Амурская область", "Камчатка", "Магадан", "Приморье", "Сахалин", "Хабаровский край", "Якутия"
  ]
};
